---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToPasteToFile
source: html/a321f6d8-bf46-21f6-9b84-83da7db79808.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CuttingFailures.UnableToPasteToFile Property

Unable to paste current clipboard contents to file.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToPasteToFile { get; }
```